/* accessibility help text for media controller time value >= 1 day */
"%1$d days %2$d hours %3$d minutes %4$d seconds" = "%1$d päivää %2$d tuntia %3$d minuuttia %4$d sekuntia";

/* accessibility help text for media controller time value >= 60 minutes */
"%1$d hours %2$d minutes %3$d seconds" = "%1$d tuntia %2$d minuuttia %3$d sekuntia";

/* accessibility help text for media controller time value >= 60 seconds */
"%1$d minutes %2$d seconds" = "%1$d minuuttia %2$d sekuntia";

/* accessibility help text for media controller time value < 60 seconds */
"%1$d seconds" = "%1$d sekuntia";

/* window title for a standalone image (uses multiplication symbol, not x) */
"%@ %@×%@ pixels" = "%@ %@×%@ pikseliä";

/* window title for a standalone image (uses multiplication symbol, not x) */
"%@ %d×%d pixels" = "%@ %d×%d pikseliä";

/* visible name of the plug-in host process. The first argument is the plug-in name and the second argument is the application name. */
"%@ (%@ Internet plug-in)" = "%@ (ohjelman %@ internet-liitännäinen)";

/* Visible name of the web process. The argument is the application name. */
"%@ Web Content" = "%@: verkkosisältö";

/* Label to describe the number of files selected in a file upload control that allows multiple files */
"%d files" = "%d tiedostoa";

/* Menu item title for KEYGEN pop-up menu */
"1024 (Medium Grade)" = "1024 (normaali)";

/* Menu item title for KEYGEN pop-up menu */
"2048 (High Grade)" = "2048 (vahva)";

/* Menu item title for KEYGEN pop-up menu */
"512 (Low Grade)" = "512 (heikko)";

/* window title for a standalone image (uses multiplication symbol, not x) */
"<filename> %d×%d pixels" = "<filename> %d×%d pikseliä";

/* Undo action name */
"Align Left (Undo action name)" = "vasemmalle tasaus";

/* Undo action name */
"Align Right (Undo action name)" = "oikealle tasaus";

/* Back context menu item */
"Back" = "Edellinen";

/* Bold context menu item */
"Bold" = "Lihavoi";

/* Capitalize context menu item */
"Capitalize" = "Jokainen sana isolla alkukirjaimella";

/* Undo action name */
"Center (Undo action name)" = "keskelle tasaus";

/* Undo action name */
"Change Attributes (Undo action name)" = "attribuuttien vaihto";

/* Check spelling context menu item */
"Check Document Now" = "Tarkista dokumentti nyt";

/* Check grammar with spelling context menu item */
"Check Grammar With Spelling" = "Tarkista kielioppi oikeinkirjoituksen ohessa";

/* Check spelling while typing context menu item */
"Check Spelling While Typing" = "Tarkista oikeinkirjoitus kirjoitettaessa";

/* title for file button used in HTML forms */
"Choose File" = "Valitse tiedosto";

/* menu item in Recent Searches menu that empties menu's contents */
"Clear Recent Searches" = "Poista äskeiset haut";

/* WebKitErrorCannotShowMIMEType description */
"Content with specified MIME type can’t be shown" = "Sisältöä ei voida näyttää määritetylle MIME-tyypille";

/* Media Controls context menu item */
"Controls" = "Säätimet";

/* Copy context menu item */
"Copy" = "Kopioi";

/* Copy Audio Address Location context menu item */
"Copy Audio Address" = "Kopioi äänen osoite";

/* Copy Image context menu item */
"Copy Image" = "Kopioi kuva";

/* Copy Image Address menu item */
"Copy Image Address" = "Kopioi kuvan osoite";

/* Copy Link context menu item */
"Copy Link" = "Kopioi linkki";

/* Copy Video Address Location context menu item */
"Copy Video Address" = "Kopioi videon osoite";

/* Correct Spelling Automatically context menu item */
"Correct Spelling Automatically" = "Korjaa oikeinkirjoitus automaattisesti";

/* Undo action name */
"Create Link (Undo action name)" = "linkin luonti";

/* Cut context menu item */
"Cut" = "Leikkaa";

/* Undo action name */
"Cut (Undo action name)" = "leikkaaminen";

/* Default writing direction context menu item */
"Default" = "Oletus";

/* text to display in <details> tag when it has no <summary> child */
"Details" = "Lisätietoja";

/* Download Image context menu item */
"Download Image" = "Lataa kuva";

/* Download Linked File context menu item */
"Download Linked File" = "Lataa linkitetty tiedosto";

/* Undo action name */
"Drag (Undo action name)" = "veto";

/* Video Enter Fullscreen context menu item */
"Enter Fullscreen" = "Siirry koko näytön tilaan";

/* Default application name for Open With context menu */
"Finder" = "Finder";

/* Font context sub-menu item */
"Font" = "Fontti";

/* Undo action name */
"Format Block (Undo action name)" = "muotoilu";

/* Forward context menu item */
"Forward" = "Seuraava";

/* WebKitErrorFrameLoadInterruptedByPolicyChange description */
"Frame load interrupted" = "Kehyksen haku keskeytetty";

/* accessibility role description for web area */
"HTML content" = "HTML-sisältö";

/* menu item title */
"Hide Spelling and Grammar" = "Kätke oikeinkirjoitus ja kielioppi";

/* menu item title */
"Hide Substitutions" = "Kätke korvaukset";

/* The default, default character encoding */
"ISO-8859-1" = "ISO-8859-1";

/* Ignore Grammar context menu item */
"Ignore Grammar" = "Älä huomioi kielioppia";

/* Ignore Spelling context menu item */
"Ignore Spelling" = "Älä huomioi oikeinkirjoitusta";

/* Undo action name */
"Indent (Undo action name)" = "sisennys";

/* Undo action name */
"Insert List (Undo action name)" = "luettelon lisäys";

/* Inspect Element context menu item */
"Inspect Element" = "Tarkista elementti";

/* Italic context menu item */
"Italic" = "Kursivoi";

/* WebKitErrorJavaUnavailable description */
"Java is unavailable" = "Java ei ole käytettävissä";

/* Undo action name */
"Justify (Undo action name)" = "reunoihin tasaus";

/* Name of keychain key generated by the KEYGEN tag */
"Key from %@" = "Avain kohteelta %@";

/* Learn Spelling context menu item */
"Learn Spelling" = "Opi oikeinkirjoitus";

/* Left to Right context menu item */
"Left to Right" = "Vasemmalta oikealle";

/* Media controller status message when watching a live broadcast */
"Live Broadcast" = "Suora lähetys";

/* Media controller status message when the media is loading */
"Loading..." = "Ladataan...";

/* Look Up in Dictionary context menu item */
"Look Up in Dictionary" = "Etsi Sanakirjasta";

/* Look Up context menu item with selected word */
"Look Up “%@”" = "Etsi ”%@”";

/* Look Up context menu item with selected word */
"Look Up “<selection>”" = "Etsi ”<selection>”";

/* Media Loop context menu item */
"Loop" = "Silmukoi";

/* Undo action name */
"Loosen Kerning (Undo action name)" = "välistyksen harvennus";

/* Undo action name */
"Lower Baseline (Undo action name)" = "peruslinjan alentaminen";

/* Make Lower Case context menu item */
"Make Lower Case" = "Muuta pieniksi kirjaimiksi";

/* Make Upper Case context menu item */
"Make Upper Case" = "Muuta isoiksi kirjaimiksi";

/* Label text to be used when a plugin is missing */
"Missing Plug-in" = "Liitännäinen puuttuu";

/* Media Mute context menu item */
"Mute" = "Mykistä";

/* No Guesses Found context menu item */
"No Guesses Found" = "Ei arvauksia";

/* Label for only item in menu that appears when clicking on the search field image, when no searches have been performed */
"No recent searches" = "Ei äskeisiä hakuja";

/* WebKitErrorCannotUseRestrictedPort description */
"Not allowed to use restricted network port" = "Rajoitetun verkkoportin käyttö ei ole sallittua";

/* Open Audio in New Window context menu item */
"Open Audio in New Window" = "Avaa ääni uudessa ikkunassa";

/* Open Frame in New Window context menu item */
"Open Frame in New Window" = "Avaa kehys uudessa ikkunassa";

/* Open Image in New Window context menu item */
"Open Image in New Window" = "Avaa kuva uudessa ikkunassa";

/* Open Link context menu item */
"Open Link" = "Avaa linkki";

/* Open in New Window context menu item */
"Open Link in New Window" = "Avaa linkki uudessa ikkunassa";

/* Open Video in New Window context menu item */
"Open Video in New Window" = "Avaa video uudessa ikkunassa";

/* context menu item for PDF */
"Open with %@" = "Avaa ohjelmalla %@";

/* Undo action name */
"Outdent (Undo action name)" = "ulonnus";

/* Outline context menu item */
"Outline" = "Reunustus";

/* Undo action name */
"Outline (Undo action name)" = "reunustus";

/* Paragraph direction context sub-menu item */
"Paragraph Direction" = "Kappaleen suunta";

/* Paste context menu item */
"Paste" = "Sijoita";

/* Undo action name */
"Paste (Undo action name)" = "sijoitus";

/* Undo action name */
"Paste Font (Undo action name)" = "fontin sijoitus";

/* Undo action name */
"Paste Ruler (Undo action name)" = "viivaimen sijoitus";

/* Media Pause context menu item */
"Pause" = "Keskeytä";

/* Media Play context menu item */
"Play" = "Toista";

/* accessibility help text for enter fullscreen button */
"Play movie in fullscreen mode" = "Toista elokuva koko näytön tilassa";

/* Label text to be used if plugin host process has crashed */
"Plug-in Failure" = "Liitännäisvirhe";

/* WebKitErrorPlugInCancelledConnection description */
"Plug-in cancelled" = "Liitännäinen kumottiin";

/* WebKitErrorPlugInWillHandleLoad description */
"Plug-in handled load" = "Liitännäisen käsittelemä sisältö";

/* Description of the (only) type supported by PDF pseudo plug-in. Visible in Installed Plug-ins page in Safari. */
"Portable Document Format" = "PDF";

/* Undo action name */
"Raise Baseline (Undo action name)" = "peruslinjan nosto";

/* label for first item in the menu that appears when clicking on the search field image, used as embedded menu title */
"Recent Searches" = "Äskeiset haut";

/* Reload context menu item */
"Reload" = "Lataa uudelleen";

/* default label for Reset buttons in forms on web pages */
"Reset" = "Palauta";

/* Right to Left context menu item */
"Right to Left" = "Oikealta vasemmalle";

/* Search in Spotlight context menu item */
"Search in Spotlight" = "Etsi Spotlightilla";

/* Search with search provider context menu item with provider name inserted */
"Search with %@" = "%@-haku";

/* Search with Google context menu item */
"Search with Google" = "Hae Googlella";

/* Selection direction context sub-menu item */
"Selection Direction" = "Valinnan suunta";

/* Undo action name */
"Set Background Color (Undo action name)" = "taustavärin asetus";

/* Undo action name */
"Set Color (Undo action name)" = "värin asetus";

/* Undo action name */
"Set Font (Undo action name)" = "fonttiasetus";

/* Undo action name */
"Set Traditional Character Shape (Undo action name)" = "perinteisen merkkimuodon asetus";

/* Undo action name */
"Set Writing Direction (Undo action name)" = "kirjoituksen suunnan asetus";

/* Show colors context menu item */
"Show Colors" = "Näytä värit";

/* Show fonts context menu item */
"Show Fonts" = "Näytä fontit";

/* menu item title */
"Show Spelling and Grammar" = "Näytä oikeinkirjoitus ja kielioppi";

/* menu item title */
"Show Substitutions" = "Näytä korvaukset";

/* Smart Copy/Paste context menu item */
"Smart Copy/Paste" = "Älykäs kopiointi/sijoitus";

/* Smart Dashes context menu item */
"Smart Dashes" = "Älykkäät väliviivat";

/* Smart Links context menu item */
"Smart Links" = "Älykkäät linkit";

/* Smart Quotes context menu item */
"Smart Quotes" = "Älykkäät lainausmerkit";

/* Speech context sub-menu item */
"Speech" = "Puhe";

/* Spelling and Grammar context sub-menu item */
"Spelling and Grammar" = "Oikeinkirjoitus ja kielioppi";

/* title for Start Debugging JavaScript menu item */
"Start Debugging JavaScript" = "Aloita JavaScriptin vianmääritys";

/* title for Start Profiling JavaScript menu item */
"Start Profiling JavaScript" = "Aloita JavaScriptin profilointi";

/* Start speaking context menu item */
"Start Speaking" = "Aloita puhuminen";

/* Stop context menu item */
"Stop" = "Keskeytä";

/* title for Stop Debugging JavaScript menu item */
"Stop Debugging JavaScript" = "Lopeta JavaScriptin vianmääritys";

/* title for Stop Profiling JavaScript menu item */
"Stop Profiling JavaScript" = "Lopeta JavaScriptin profilointi";

/* Stop speaking context menu item */
"Stop Speaking" = "Lopeta puhuminen";

/* Styles context menu item */
"Styles..." = "Tyylit...";

/* default label for Submit buttons in forms on web pages */
"Submit" = "Lähetä";

/* alt text for <input> elements with no alt, title, or value */
"Submit (input element)" = "Lähetä";

/* Undo action name */
"Subscript (Undo action name)" = "alaindeksointi";

/* Substitutions context sub-menu item */
"Substitutions" = "Korvaukset";

/* Undo action name */
"Superscript (Undo action name)" = "yläindeksointi";

/* Text Replacement context menu item */
"Text Replacement" = "Tekstin korvaus";

/* WebKitErrorCannotShowURL description */
"The URL can’t be shown" = "Osoitetta ei voida näyttää";

/* WebKitErrorGeolocationLocationUnknown description */
"The current location cannot be found." = "Nykyistä sijaintia ei löytynyt.";

/* WebKitErrorCannotFindPlugin description */
"The plug-in can’t be found" = "Liitännäistä ei löydy";

/* WebKitErrorCannotLoadPlugin description */
"The plug-in can’t be loaded" = "Liitännäistä ei voida ladata";

/* prompt string in authentication panel */
"The user name or password you entered for area “%@” on %@ was incorrect. Make sure you’re entering them correctly, and then try again." = "Alueelle ”%@” (%@) syöttämäsi käyttäjätunnus tai salasana oli virheellinen. Varmista, että syötät ne oikein, ja yritä uudelleen.";

/* prompt string in authentication panel */
"The user name or password you entered for the %@ proxy server %@ was incorrect. Make sure you’re entering them correctly, and then try again." = "Välipalvelimelle %@ (%@) syöttämäsi käyttäjätunnus tai salasana oli virheellinen. Varmista, että syötät ne oikein, ja yritä uudelleen.";

/* prompt string in authentication panel */
"The user name or password you entered for this area on %@ was incorrect. Make sure you’re entering them correctly, and then try again." = "Syöttämäsi käyttäjätunnus tai salasana tälle alueelle osoitteessa %@ oli virheellinen. Varmista, että syötät ne oikein, ja yritä uudelleen.";

/* text that appears at the start of nearly-obsolete web pages in the form of a 'searchable index' */
"This is a searchable index. Enter search keywords: " = "Indeksistä voidaan tehdä hakuja. Etsi avainsanoja: ";

/* Undo action name */
"Tighten Kerning (Undo action name)" = "välistyksen tiivistys";

/* prompt string in authentication panel */
"To view this page, you must log in to area “%@” on %@." = "Jos haluat nähdä sivun, sinun täytyy kirjautua alueelle ”%@” (%@).";

/* prompt string in authentication panel */
"To view this page, you must log in to the %@ proxy server %@." = "Jos haluat nähdä sivun, sinun täytyy kirjautua välipalvelimelle %@ (%@).";

/* prompt string in authentication panel */
"To view this page, you must log in to this area on %@:" = "Voit katsella sivua kirjautumalla alueelle osoitteessa %@:";

/* Transformations context sub-menu item */
"Transformations" = "Muunnokset";

/* Undo action name */
"Turn Off Kerning (Undo action name)" = "välistyksen poisto";

/* Undo action name */
"Turn Off Ligatures (Undo action name)" = "ligatuurien poisto";

/* Undo action name */
"Typing (Undo action name)" = "kirjoitus";

/* Underline context menu item */
"Underline" = "Alleviivaa";

/* Undo action name */
"Underline (Undo action name)" = "alleviivaus";

/* Unknown filesize FTP directory listing item */
"Unknown" = "Tuntematon";

/* Undo action name */
"Unlink (Undo action name)" = "linkin poisto";

/* Undo action name */
"Unscript (Undo action name)" = "indeksin poisto";

/* Undo action name */
"Use All Ligatures (Undo action name)" = "kaikkien ligatuurien käyttö";

/* Undo action name */
"Use Standard Kerning (Undo action name)" = "vakioparivälistyksen käyttö";

/* Undo action name */
"Use Standard Ligatures (Undo action name)" = "vakioligatuurien käyttö";

/* Web Inspector window title */
"Web Inspector — %@" = "Verkkoerittely — %@";

/* Pseudo plug-in name, visible in Installed Plug-ins page in Safari. */
"WebKit built-in PDF" = "WebKitin sisäinen PDF";

/* message in authentication panel */
"Your login information will be sent securely." = "Kirjautumistiedot lähetetään suojatussa muodossa.";

/* message in authentication panel */
"Your password will be sent unencrypted." = "Salasana lähetetään salaamattomana.";

/* HTTP result code string */
"accepted" = "hyväksytty";

/* Verb stating the action that will occur when a text field is selected, as used by accessibility */
"activate" = "ota käyttöön";

/* An ARIA accessibility group that acts as an alert. */
"alert" = "varoitus";

/* An ARIA accessibility group that acts as an alert dialog. */
"alert dialog" = "varoitusikkuna";

/* An ARIA accessibility group that acts as an application. */
"application" = "ohjelma";

/* An ARIA accessibility group that acts as a status update. */
"application status" = "ohjelman tila";

/* An ARIA accessibility group that acts as an article. */
"article" = "artikkeli";

/* accessibility role description for audio element controller */
"audio element controller" = "äänielementin ohjain";

/* accessibility role description for audio element controller */
"audio element playback controls and status display" = "äänielementin toisto-ohjaimet ja tilanäyttö";

/* accessibility role description for seek back 30 seconds button */
"back 30 seconds" = "taaksepäin 30 sekuntia";

/* HTTP result code string */
"bad gateway" = "virheellinen yhdyskäytävä";

/* HTTP result code string */
"bad request" = "virheellinen pyyntö";

/* An ARIA accessibility group that acts as a banner. */
"banner" = "banneri";

/* accessibility help text for play button */
"begin playback" = "aloita toisto";

/* Verb stating the action that will occur when an unchecked checkbox is clicked, as used by accessibility */
"check" = "valitse";

/* HTTP result code string */
"client error" = "asiakasvirhe";

/* An ARIA accessibility group that acts as a region of complementary information. */
"complementary" = "täydentävä";

/* HTTP result code string */
"conflict" = "ristiriita";

/* An ARIA accessibility group that contains content. */
"content" = "sisältö";

/* HTTP result code string */
"continue" = "jatka";

/* HTTP result code string */
"created" = "luotu";

/* accessibility help text for movie status display */
"current movie status" = "nykyisen elokuvan tila";

/* accessibility help text for elapsed time display */
"current movie time in seconds" = "nykyisen elokuvan aika sekunneissa";

/* definition phrase */
"definition" = "määritelmä";

/* An ARIA accessibility group that acts as an dialog. */
"dialog" = "valintaikkuna";

/* An ARIA accessibility group that acts as a document. */
"document" = "dokumentti";

/* accessibility role description for elapsed time display */
"elapsed time" = "kulunut aika";

/* HTTP result code string */
"expectation failed" = "odotus epäonnistui";

/* accessibility role description for fast forward button */
"fast forward" = "selaa eteenpäin";

/* accessibility role description for fast reverse button */
"fast reverse" = "nopeasti taaksepäin";

/* HTTP result code string */
"forbidden" = "kielletty";

/* HTTP result code string */
"found" = "löytyi";

/* accessibility role description for enter fullscreen button */
"fullscreen" = "koko näyttö";

/* HTTP result code string */
"gateway timed out" = "yhdyskäytävä aikakatkaistiin";

/* accessibility role description for headings */
"heading" = "otsikko";

/* accessibility role description for hide closed captions button */
"hide closed captions" = "Kätke kuvaileva tekstitys";

/* accessibility role description for image map */
"image map" = "kuvakartta";

/* accessibility help text for an indefinite media controller time value */
"indefinite time" = "määrittämätön aika";

/* HTTP result code string */
"informational" = "tieto";

/* HTTP result code string */
"internal server error" = "palvelimen sisäinen virhe";

/* Verb stating the action that will occur when a link is clicked, as used by accessibility */
"jump" = "siirry";

/* HTTP result code string */
"length required" = "pituus vaaditaan";

/* accessibility role description for link */
"link" = "linkki";

/* accessibility role description for list marker */
"list marker" = "luettelomerkki";

/* An ARIA accessibility group that acts as a console log. */
"log" = "loki";

/* An ARIA accessibility group that is the main portion of the website. */
"main" = "pää";

/* An ARIA accessibility group that acts as a marquee. */
"marquee" = "markiisi";

/* An ARIA accessibility group that contains mathematical symbols. */
"math" = "matematiikka";

/* HTTP result code string */
"method not allowed" = "menetelmä ei sallittu";

/* HTTP result code string */
"moved permanently" = "siirretty pysyvästi";

/* accessibility role description for timeline slider */
"movie time" = "elokuvan aika";

/* accessibility help text for timeline slider */
"movie time scrubber" = "elokuvan ajan selauspalkki";

/* accessibility help text for timeline slider thumb */
"movie time scrubber thumb" = "elokuvan ajan selauspalkin miniatyyri";

/* HTTP result code string */
"multiple choices" = "useita vaihtoehtoja";

/* accessibility role description for mute button */
"mute" = "mykistä";

/* accessibility help text for mute button */
"mute audio tracks" = "mykistä ääniraidat";

/* An ARIA accessibility group that contains the main navigation elements of a website. */
"navigation" = "selaus";

/* HTTP result code string */
"needs proxy" = "tarvitsee välipalvelimen";

/* HTTP result code string */
"no content" = "ei sisältöä";

/* HTTP result code string */
"no error" = "ei virhettä";

/* text to display in file button used in HTML forms when no file is selected */
"no file selected" = "tiedostoa ei ole valittu";

/* HTTP result code string */
"no longer exists" = "ei ole enää olemassa";

/* HTTP result code string */
"non-authoritative information" = "varmentamaton tieto";

/* HTTP result code string */
"not found" = "ei löytynyt";

/* HTTP result code string */
"not modified" = "ei muokattu";

/* An ARIA accessibility group that acts as a note in a document. */
"note" = "muistiinpano";

/* accessibility help text for remaining time display */
"number of seconds of movie remaining" = "elokuvan jäljellä oleva aika sekunneissa";

/* HTTP result code string */
"partial content" = "osittainen sisältö";

/* Validation message for input form controls requiring a constrained value according to pattern */
"pattern mismatch" = "kuvio ei täsmää";

/* accessibility role description for pause button */
"pause" = "keskeytä";

/* accessibility help text for pause button */
"pause playback" = "keskeytä toisto";

/* HTTP result code string */
"payment required" = "maksu vaaditaan";

/* accessibility role description for play button */
"play" = "toista";

/* HTTP result code string */
"precondition failed" = "ennakkoehto epäonnistui";

/* Verb stating the action that will occur when a button is pressed, as used by accessibility */
"press" = "paina";

/* HTTP result code string */
"proxy authentication required" = "välipalvelimen todentaminen vaaditaan";

/* Validation message for input form controls with value higher than allowed maximum */
"range overflow" = "alueen ylivuoto";

/* Validation message for input form controls with value lower than allowed minimum */
"range underflow" = "alueen alivuoto";

/* HTTP result code string */
"redirected" = "uudelleenohjattu";

/* An ARIA accessibility group that acts as a distinct region in a document. */
"region" = "alue";

/* accessibility role description for time remaining display */
"remaining time" = "jäljellä oleva aika";

/* HTTP result code string */
"request timed out" = "pyyntö aikakatkaistiin";

/* HTTP result code string */
"request too large" = "pyyntö liian suuri";

/* HTTP result code string */
"requested URL too long" = "pyydetty osoite liian pitkä";

/* HTTP result code string */
"requested range not satisfiable" = "pyydetty alue virheellinen";

/* HTTP result code string */
"reset content" = "nollaa sisältö";

/* accessibility help text for return streaming movie to real time button */
"return streaming movie to real time" = "palauta suoratoistoelokuva reaaliaikaan";

/* accessibility role description for return to real time button */
"return to realtime" = "palauta reaaliaikaan";

/* An ARIA accessibility group that contains a search feature of a website. */
"search" = "hae";

/* HTTP result code string */
"see other" = "katso muu";

/* accessibility help text for jump back 30 seconds button */
"seek movie back 30 seconds" = "etsi elokuvaa taaksepäin 30 sekuntia";

/* accessibility help text for fast rewind button */
"seek quickly back" = "etsi nopeasti taaksepäin";

/* accessibility help text for fast forward button */
"seek quickly forward" = "etsi nopeasti eteenpäin";

/* Verb stating the action that will occur when a radio button is clicked, as used by accessibility */
"select" = "valitse";

/* HTTP result code string */
"server error" = "palvelinvirhe";

/* HTTP result code string */
"service unavailable" = "palvelu ei käytettävissä";

/* accessibility role description for show closed captions button */
"show closed captions" = "näytä kuvaileva tekstitys";

/* accessibility help text for show closed captions button */
"start displaying closed captions" = "aloita kuvailevan tekstityksen näyttäminen";

/* accessibility role description for movie status */
"status" = "tila";

/* Validation message for input form controls with value not respecting the step attribute */
"step mismatch" = "askel ei täsmää";

/* accessibility help text for hide closed captions button */
"stop displaying closed captions" = "lopeta kuvailevan tekstityksen näyttäminen";

/* HTTP result code string */
"success" = "onnistui";

/* HTTP result code string */
"switching protocols" = "vaihdetaan protokollia";

/* An ARIA accessibility group that contains the content of a tab. */
"tab panel" = "välilehtipaneeli";

/* HTTP result code string */
"temporarily redirected" = "väliaikaisesti uudelleenohjattu";

/* term word of a definition */
"term" = "termi";

/* accessibility role description for timeline thumb */
"timeline slider thumb" = "aikajanan liukusäätimen miniatyyri";

/* An ARIA accessibility group that acts as an updating timer. */
"timer" = "ajastin";

/* Validation message for form control elements with a value longer than maximum allowed length */
"too long" = "liian pitkä";

/* An ARIA accessibility group that acts as a tooltip. */
"tooltip" = "työkaluvinkki";

/* Validation message for input form controls with a value not matching type */
"type mismatch" = "tyyppi ei täsmää";

/* HTTP result code string */
"unacceptable" = "ei kelpaa";

/* HTTP result code string */
"unauthorized" = "ei valtuutettu";

/* Verb stating the action that will occur when a checked checkbox is clicked, as used by accessibility */
"uncheck" = "poista valinta";

/* HTTP result code string */
"unimplemented" = "ei toteutettu";

/* Unknown filename */
"unknown" = "tuntematon";

/* accessibility role description for turn mute off button */
"unmute" = "poista mykistys";

/* accessibility help text for un mute button */
"unmute audio tracks" = "poista ääniraitojen mykistys";

/* HTTP result code string */
"unsupported media type" = "ei tuettu mediatyyppi";

/* HTTP result code string */
"unsupported version" = "ei tuettu versio";

/* Validation message for required form control elements that have no value */
"value missing" = "arvo puuttuu";

/* accessibility role description for video element controller */
"video element controller" = "videoelementin ohjain";

/* accessibility role description for video element controller */
"video element playback controls and status display" = "videoelementin toisto-ohjaimet ja tilanäyttö";

